app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "aaa"], ["created_at", "2014-10-16 15:59:44.537791"], ["title", "aaa"], ["updated_at", "2014-10-16 15:59:44.537791"]]
---
	def create
		@post = Post.new(post_params)
		if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "content" = ?, "title" = ?, "updated_at" = ? WHERE "posts"."id" = 1  [["content", "fasdfasd"], ["title", "aaadfsd"], ["updated_at", "2014-10-16 16:26:52.359720"]]
---
	def update
		@post = Post.find(params[:id])
		if @post.update(post_params)